{
  "name": "نص التعليمات لإسم سير العمل الجديد",
  "description": "نص التعليمات لوصف سير العمل الجديد",
  "createFlow": "يمكنك إنشاء سير العمل على مستوى أعلى داخل هذا النموذج.",
  "flowType": "ما هو نوع هذا النموذج",
  "topLevelFlowType": "ما هو نوع سير العمل على المستوى الأعلى؟ يُستخدم النوع \"عميل\" لمصادقة العملاء (التطبيقات) ، بينما يُستخدم \"شامل\" للمستخدمين وكل ما هو آخر.",
  "addSubFlow": "يمكن أن تكون سيور العمل الفرعية عامة أو نموذجية. يستخدم نوع نموذجية لبناء سيور العمل فرعي ينتج عنها سير عمل واحدًا للمستخدم. سيور العمل الفرعية هي نوع خاص من التنفيذ يقيم نجاحه اعتمادًا على كيفية تقييم التنفيذات التي تحتوي عليها.",
  "alias": "اسم التكوين",
  "otpType": "الـtotp هي كلمة مرور مؤقتة معتمدة على الوقت، بينما الـhotp هي كلمة مرور مؤقتة معتمدة على العداد، حيث يحتفظ الخادم بعداد للتجزئة عليه.",
  "webAuthnPolicyRpEntityName": "اسم خادم يمكن قراءته بواسطة الإنسان كطرف المعتمد لWebAuthn ",
  "otpHashAlgorithm": "ما هي خوارزمية التجزئة المستخدمة لتوليد كلمة المرور المؤقتة.",
  "otpPolicyDigits": "كم عدد الأرقام التي يجب أن تحتويها كلمة المرور المؤقتة؟",
  "lookAhead": "كم يجب أن يتطلع الخادم إلى المستقبل في حالة تعذر تزامن مولد الرمز والخادم بخصوص الوقت أو العداد؟",
  "otpPolicyPeriod": "كم يجب أن يكون  وقت الصلاحية لرمز كلمة المرور المؤقتة؟ يتم تعيين الإعداد الافتراضي لصلاحية الرمز على 30 ثانية.",
  "otpPolicyCodeReusable": "هل يمكن إعادة استخدام نفس رمز كلمة المرور المؤقتة بعد المصادقة الناجحة.",
  "supportedApplications": "التطبيقات المعروفة بأنها تعمل مع سياسة كلمة المرور المؤقتة الحالية.",
  "webauthnIntro": "ما هو الغرض من هذا النموذج؟",
  "webAuthnPolicyFormHelp": "هذا النموذج يستخدم لتعريف سياسة المصادقة بواسطة WebAuthn. سيتم استخدام هذه السياسة في الإجراء المطلوب 'تسجيل WebAuth ' و الوسيط 'المصادقة WebAuthn'. الاستخدام النموذجي هو عند استخدام WebAuthn للمصادقة الثنائية العامل.",
  "webAuthnPolicyPasswordlessFormHelp": "سيتم استخدام هذه السياسة للتحقق من الشخصية دون كلمة المرور عبر WebAuthn. يجب على 'Webauthn سجل بدون كلمة مرور' القيام بالإجراءات المطلوبة ومصادق 'WebAuthn المصادقة بدون كلمة مرور'. وبشكل عام، سيتم استخدام WebAuthn كعامل مصادقة أولي. والحصول على كلا من 'سياسة WebAuthn' و'سياسة WebAuthn بدون كلمة مرور' يتيح استخدام WebAuthn كعامل مصادقة",
  "webAuthnPolicySignatureAlgorithms": "ما هي خوارزميات التوقيع التي يجب استخدامها لتأكيد المصادقة.",
  "webAuthnPolicyRpId": "هذا هو معرف الطرف المعتمد في WebAuthn ويجب أن يكون نطاق الموقع الفعال الخاص بالأصل الذي يتم استخدامه.",
  "webAuthnPolicyAttestationConveyancePreference": "يتواصل مع وسيط المصادقة لتحديد التفضيلات في توليد بيان التصديق.",
  "webAuthnPolicyAuthenticatorAttachment": "يتواصل مع وسيط المصادقة لتحديد نمط الاتصال المقبول.",
  "webAuthnPolicyRequireResidentKey": "يخبر وسيط المصادقة بإنشاء بيان مصدق كمفتاح مقيم أو غير ذلك.",
  "webAuthnPolicyUserVerificationRequirement": "يتواصل مع وسيط المصادقة لتأكيد التحقق الفعلي من هوية المستخدم.",
  "webAuthnPolicyCreateTimeout": "يحدد القيمة الزمنية المحددة لإنشاء بيان مصدق للمستخدم بالثواني. وإذا تم تعيينه على القيمة 0، فإن خيار الإنهاء الزمني لن يتم تطبيقه.",
  "webAuthnPolicyAvoidSameAuthenticatorRegister": "يتجنب تسجيل وسيط المصادقة الذي تم تسجيله مسبقا.",
  "webAuthnPolicyAcceptableAaguids": "قائمة AAGUID التي يمكن تسجيل وسيط المصادقة من خلالها.",
  "passwordPolicies": {
    "forceExpiredPasswordChange": "عدد الأيام التي يمكن فيها استخدام كلمة المرور قبل أن يجب تغييرها إلى كلمة مرور جديدة.",
    "hashIterations": "عدد مرات تطبيق خوارزمية التجزئة على كلمة المرور قبل تخزينها أو التحقق من صحتها. القيمة الافتراضية هي 27،500.",
    "passwordHistory": "منع إعادة استخدام كلمات المرور التي تم استخدامها مؤخرا.",
    "passwordBlacklist": "منع استخدام كلمات المرور الموجودة في ملف القائمة السوداء.",
    "regexPattern": "يتطلب تطابق كلمة المرور مع نمط من النماذج العادية المحددة.",
    "length": "الحد الأدنى لعدد الحروف المطلوبة في كلمة المرور.",
    "notUsername": "لا يمكن أن تكون كلمة المرور مطابقة لاسم المستخدم.",
    "notEmail": "لا يمكن أن تكون كلمة المرور مطابقة لعنوان البريد الإلكتروني الخاص بالمستخدم.",
    "specialChars": "عدد الأحرف الخاصة المطلوبة في سلسلة كلمة المرور.",
    "upperCase": "عدد الأحرف الكبيرة المطلوبة في سلسلة كلمة المرور.",
    "lowerCase": "عدد الأحرف الصغيرة المطلوبة في سلسلة كلمة المرور.",
    "digits": "عدد الأرقام المطلوبة في سلسلة كلمة المرور.",
    "hashAlgorithm": "يطبق خوارزمية التجزئة الى كلمات المرور، حتى لا تتم تخزينها على شكل نص واضح.",
    "maxLength": "أقصى عدد مسموح به من الأحرف في كلمة المرور."
  },
  "cibaBackchannelTokenDeliveryMode": "يحدد كيفية حصول جهاز الاستهلاك (CD) على نتيجة المصادقة والرموز المماثلة. سيتم استخدام هذا الوضع بشكل افتراضي لعملاء CIBA الذين لا يحتوون على وضع آخر محدد.",
  "cibaExpiresIn": "وقت انتهاء \"auth_req_id\" بالثواني منذ استلام طلب المصادقة.",
  "cibaInterval": "الحد الأدنى للوقت بالثواني الذي يجب أن ينتظره جهاز الاستهلاك (CD) بين طلبات الاستطلاع لنقطة نهاية الرمز المميز. إذا تم تعيينها على الصفر ، يجب أن يستخدم جهاز الاستهلاك 5 كقيمة افتراضية وفقًا لمواصفات CIBA.",
  "cibaAuthRequestedUserHint": "طريقة تحديد المستخدم النهائي الذي يتم طلب المصادقة منه. حاليًا يتم دعم \"login_hint\" فقط."
}