{
  "name": "اسم نطاق العميل. يجب أن يكون فريدًا في المجال. يجب أن لا يحتوي الاسم على مسافات حيث يتم استخدامه كقيمة لمعلمة النطاق",
  "description": "وصف نطاق العميل",
  "protocol": "أي بروتوكول SSO يتم توفيره بواسطة نطاق العميل هذا",
  "type": "نطاقات العميل، والتي سيتم إضافتها كنطاقات افتراضية إلى كل عميل يتم إنشاؤه",
  "displayOnConsentScreen": "إذا تم تفعيل هذا الخيار، وتم إضافة نطاق العميل هذا لبعض العملاء الذين يتطلب الحصول على موافقة، سيتم عرض النص المحدد في 'نص شاشة الموافقة'. إذا تم إيقاف تفعيله، لن يتم عرض نطاق العميل هذا على شاشة الموافقة",
  "consentScreenText": "النص الذي سيتم عرضه على شاشة الموافقة عند إضافة نطاق العميل هذا لبعض العملاء الذين يتطلب الحصول على موافقة. يتم تعيين القيمة الافتراضية لاسم نطاق العميل إذا لم يتم إدخال نص",
  "includeInTokenScope": "إذا تم تفعيل هذا الخيار، سيتم إضافة اسم نطاق العميل هذا إلى خاصية رمز الوصول 'نطاق الوصول'، وكذلك إلى استجابة نقطة انتروسبيشن توكن. إذا تم إيقاف تفعيله، سيتم استبعاد نطاق العميل هذا من الرمز ومن استجابة نقطة انتروسبيشن توكن",
  "guiOrder": "تحديد ترتيب مزود الخدمة في واجهة المستخدم الرسومية (مثل صفحة الموافقة) كعدد صحيح",
  "prefix": "بادئة لكل دور مجال (اختياري).",
  "multiValued": "يشير إلى ما إذا كان السمة تدعم قيم متعددة. إذا كانت القيمة صحيحة، فسيتم تعيين قائمة جميع قيم هذه السمة كدعوى. إذا كانت القيمة خاطئة، فسيتم تعيين القيمة الأولى فقط كدعوى",
  "tokenClaimName": "اسم الدعوى التي يتم إدراجها في الرمز. يمكن أن يكون هذا الاسم مؤهلًا تأهيلاً كاملاً مثل 'address.street'. في هذه الحالة، سيتم إنشاء كائن JSON متداخل. لمنع التداخل واستخدام النقطة حرفيًا، استخدم شرطة الخلفية (\\.) للتهرب من النقطة.",
  "claimJsonType": "نوع JSON الذي يجب استخدامه لملء الدعوى JSON في الرمز. long و int و boolean و String و JSON هي قيم صالحة.",
  "protocolMapper": "بروتوكول...",
  "mapperName": "اسم المحول",
  "role": "اسم الدور الذي تريد تغييره. انقر فوق زر 'تحديد الدور' للتصفح في الأدوار، أو اكتبه في مربع النص. للإشارة إلى دور التطبيق، استخدم الصيغة اسم_التطبيق.دور_التطبيق، على سبيل المثال myapp.myrole",
  "newRoleName": "اسم الدور الجديد. يتوافق تنسيق الاسم الجديد مع موقع تعيين الدور في رمز الوصول. لذا، سيتم تعيين الدور إلى تلك الموضع في رمز الوصول إذا كان الاسم الجديد هو 'myapp.newname'. سيتم تعيين الدور إلى أدوار المجال في الرمز إذا كان الاسم الجديد هو 'newname'.",
  "rolesScope": "إذا لم يتم تحديد تعيينات نطاق الدور، يُسمح لكل مستخدم باستخدام نطاق هذا العميل. إذا تم تعريف تعيينات نطاق الدور، يجب أن يكون المستخدم عضوًا في واحد على الأقل من الأدوار."
}